src/mathematics/linear_algebra/KBe20math530refFallFinalPrep.org
#+AUTHOR: Exr0n
#+TITLE: Final Prep (review)
* Definitions
** Algebraic Structures
*** Group
    A set of items and an operation that satisfy closure, identity, inverse, assocativity
*** Field
    A group and another "secondary" operation that the set is almost a group under (except the additive identity will have no multiplicative inverse).
*** Vector Space
    A field and a set of vectors that can be added together or multiplied by scalars from the field, *with the following five properties:*
    - commutativity
    - assocativity
    - additive identity
    - additive inverse
    - distributive property
*** Subspace
    A subset of a vector space that is itself a vector space. Only need to show that it:
    1. Includes the additive identity (0)
    2. Is closed under addition
    3. Is closed under scalar multiplication
    *The subspace must use the same addition and scalar multiplication of its "superspace"*
*** Sum
    A sum of (*multiple*) *subsets* is all vectors that can be written as the sum of one vector from each sub *set* (or zero).
*** Direct Sum
    If each element in a sum of (*multiple*) subspaces can be written in only one way (with one summand from each subspace).
**** Results
***** Condition for a direct sum
      *The only way to write zero as sum of one element from each summand space is all zeros iff the sum is a direct sum.*
***** Condition for a direct sum of two subspaces
      The intersection of the two subspaces is zero iff the sum is a direct sum.
*** Linear Combination
    A linear combination is the sum of some list of vectors with each one multiplied by a coefficient from $\mathbb F$
*** Linear (In)Dependence
    *A list of vectors is linearly independent if the only coefficients in a linear combination equal to zero are all zeros. (The only $a_1, \ldots, a_n$ s.t. $a_1v_1 + \cdots +a_nv_n = 0$ is $0, \ldots, 0$)*
    Equivalent: A vector is linearly dependent in a list (and that list is linearly dependent) if it can be written as a linear combination of other vectors in the list.
    Any list that is not linearly dependent is linearly independent.
*** Span
    The span of a list is all linear combinations of that list
*** Basis
    The basis of a vector space is a linearly indepnedent list of the elements in that vector space that spans the vector space (whose span is the vector space).
    A list of vetors is a basis if there is exactly one way to write every vector as a linear combination of the basis.
**** Results
***** All bases of a vector space are the same length
***** A linearly indpendent or spanning list of the right length is a basis (buy one get one free)
*** Dimension
    The dimension of a subspace is the length of it's basis. If the basis does not exist (infinitely long), then the space is infinite dimensional.
*** Elementry Matrix
    A matrix that applies exactly one valid "row operation": multiply a row, add one row to another, swap row orders.
*** Nonsingular / invertible matrix
    A non-singular matrix is a matrix that has an inverse, and whose determinant is not zero.
