docs/mathematics/linear_algebra/KBe20math530refFallFinalPrep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Final Prep (review)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Exr0n" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Final Prep (review)</h1>
<div id="outline-container-orgad805b4" class="outline-2">
<h2 id="orgad805b4"><span class="section-number-2">1</span> Definitions</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5173b53" class="outline-3">
<h3 id="org5173b53"><span class="section-number-3">1.1</span> Algebraic Structures</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org0b6f1dd" class="outline-4">
<h4 id="org0b6f1dd"><span class="section-number-4">1.1.1</span> Group</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
A set of items and an operation that satisfy closure, identity, inverse, assocativity
</p>
</div>
</div>
<div id="outline-container-org91de7b4" class="outline-4">
<h4 id="org91de7b4"><span class="section-number-4">1.1.2</span> Field</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
A group and another "secondary" operation that the set is almost a group under (except the additive identity will have no multiplicative inverse).
</p>
</div>
</div>
<div id="outline-container-orgb055aaa" class="outline-4">
<h4 id="orgb055aaa"><span class="section-number-4">1.1.3</span> Vector Space</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
A field and a set of vectors that can be added together or multiplied by scalars from the field, <b>with the following five properties:</b>
</p>
<ul class="org-ul">
<li>commutativity</li>
<li>assocativity</li>
<li>additive identity</li>
<li>additive inverse</li>
<li>distributive property</li>
</ul>
</div>
</div>
<div id="outline-container-orgf795c63" class="outline-4">
<h4 id="orgf795c63"><span class="section-number-4">1.1.4</span> Subspace</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
A subset of a vector space that is itself a vector space. Only need to show that it:
</p>
<ol class="org-ol">
<li>Includes the additive identity (0)</li>
<li>Is closed under addition</li>
<li>Is closed under scalar multiplication</li>
</ol>
<p>
<b>The subspace must use the same addition and scalar multiplication of its "superspace"</b>
</p>
</div>
</div>
<div id="outline-container-org7057b9f" class="outline-4">
<h4 id="org7057b9f"><span class="section-number-4">1.1.5</span> Sum</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
A sum of (<b>multiple</b>) <b>subsets</b> is all vectors that can be written as the sum of one vector from each sub <b>set</b> (or zero).
</p>
</div>
</div>
<div id="outline-container-org7bf218e" class="outline-4">
<h4 id="org7bf218e"><span class="section-number-4">1.1.6</span> Direct Sum</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
If each element in a sum of (<b>multiple</b>) subspaces can be written in only one way (with one summand from each subspace).
</p>
</div>
<ol class="org-ol">
<li><a id="org530025d"></a>Results<br />
<ol class="org-ol">
<li><a id="org83295a4"></a>Condition for a direct sum<br />
<div class="outline-text-6" id="text-1-1-6-1-1">
<p>
<b>The only way to write zero as sum of one element from each summand space is all zeros iff the sum is a direct sum.</b>
</p>
</div>
</li>
<li><a id="org5c76344"></a>Condition for a direct sum of two subspaces<br />
<div class="outline-text-6" id="text-1-1-6-1-2">
<p>
The intersection of the two subspaces is zero iff the sum is a direct sum.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org9f5aeb5" class="outline-4">
<h4 id="org9f5aeb5"><span class="section-number-4">1.1.7</span> Linear Combination</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
A linear combination is the sum of some list of vectors with each one multiplied by a coefficient from \(\mathbb F\)
</p>
</div>
</div>
<div id="outline-container-org56e8df3" class="outline-4">
<h4 id="org56e8df3"><span class="section-number-4">1.1.8</span> Linear (In)Dependence</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
<b>A list of vectors is linearly independent if the only coefficients in a linear combination equal to zero are all zeros. (The only \(a_1, \ldots, a_n\) s.t. \(a_1v_1 + \cdots +a_nv_n = 0\) is \(0, \ldots, 0\))</b>
Equivalent: A vector is linearly dependent in a list (and that list is linearly dependent) if it can be written as a linear combination of other vectors in the list.
Any list that is not linearly dependent is linearly independent.
</p>
</div>
</div>
<div id="outline-container-orgd583987" class="outline-4">
<h4 id="orgd583987"><span class="section-number-4">1.1.9</span> Span</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
The span of a list is all linear combinations of that list
</p>
</div>
</div>
<div id="outline-container-orgf535254" class="outline-4">
<h4 id="orgf535254"><span class="section-number-4">1.1.10</span> Basis</h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
The basis of a vector space is a linearly indepnedent list of the elements in that vector space that spans the vector space (whose span is the vector space).
A list of vetors is a basis if there is exactly one way to write every vector as a linear combination of the basis.
</p>
</div>
<ol class="org-ol">
<li><a id="org4e86796"></a>Results<br />
<ol class="org-ol">
<li><a id="orgfe5c6f0"></a>All bases of a vector space are the same length<br /></li>
<li><a id="orgbc1865d"></a>A linearly indpendent or spanning list of the right length is a basis (buy one get one free)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org864b820" class="outline-4">
<h4 id="org864b820"><span class="section-number-4">1.1.11</span> Dimension</h4>
<div class="outline-text-4" id="text-1-1-11">
<p>
The dimension of a subspace is the length of it's basis. If the basis does not exist (infinitely long), then the space is infinite dimensional.
</p>
</div>
</div>
<div id="outline-container-org9d8f164" class="outline-4">
<h4 id="org9d8f164"><span class="section-number-4">1.1.12</span> Elementry Matrix</h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
A matrix that applies exactly one valid "row operation": multiply a row, add one row to another, swap row orders.
</p>
</div>
</div>
<div id="outline-container-org600ca38" class="outline-4">
<h4 id="org600ca38"><span class="section-number-4">1.1.13</span> Nonsingular / invertible matrix</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
A non-singular matrix is a matrix that has an inverse, and whose determinant is not zero.
</p>
</div>
</div>
</div>
