docs/mathematics/linear_algebra/KBe20math530refFallFinalPrep.tex
% Created 2021-09-11 Sat 16:42
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{Final Prep (review)}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={Final Prep (review)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Definitions}
\label{sec:orgda798fc}
\subsection{Algebraic Structures}
\label{sec:org615068c}
\subsubsection{Group}
\label{sec:orgf36e53c}
A set of items and an operation that satisfy closure, identity, inverse, assocativity
\subsubsection{Field}
\label{sec:org96d8145}
A group and another "secondary" operation that the set is almost a group under (except the additive identity will have no multiplicative inverse).
\subsubsection{Vector Space}
\label{sec:orgd7c37bd}
A field and a set of vectors that can be added together or multiplied by scalars from the field, \textbf{with the following five properties:}
\begin{itemize}
\item commutativity
\item assocativity
\item additive identity
\item additive inverse
\item distributive property
\end{itemize}
\subsubsection{Subspace}
\label{sec:orgfdb6a48}
A subset of a vector space that is itself a vector space. Only need to show that it:
\begin{enumerate}
\item Includes the additive identity (0)
\item Is closed under addition
\item Is closed under scalar multiplication
\end{enumerate}
\textbf{The subspace must use the same addition and scalar multiplication of its "superspace"}
\subsubsection{Sum}
\label{sec:orgc6f1a2a}
A sum of (\textbf{multiple}) \textbf{subsets} is all vectors that can be written as the sum of one vector from each sub \textbf{set} (or zero).
\subsubsection{Direct Sum}
\label{sec:org64f0e2c}
If each element in a sum of (\textbf{multiple}) subspaces can be written in only one way (with one summand from each subspace).
\begin{enumerate}
\item Results
\label{sec:org6e0b312}
\begin{enumerate}
\item Condition for a direct sum
\label{sec:orgd9872ab}
\textbf{The only way to write zero as sum of one element from each summand space is all zeros iff the sum is a direct sum.}
\item Condition for a direct sum of two subspaces
\label{sec:orgacdfd4a}
The intersection of the two subspaces is zero iff the sum is a direct sum.
\end{enumerate}
\end{enumerate}
\subsubsection{Linear Combination}
\label{sec:orgf1481b8}
A linear combination is the sum of some list of vectors with each one multiplied by a coefficient from \(\mathbb F\)
\subsubsection{Linear (In)Dependence}
\label{sec:org0276287}
\textbf{A list of vectors is linearly independent if the only coefficients in a linear combination equal to zero are all zeros. (The only \(a_1, \ldots, a_n\) s.t. \(a_1v_1 + \cdots +a_nv_n = 0\) is \(0, \ldots, 0\))}
Equivalent: A vector is linearly dependent in a list (and that list is linearly dependent) if it can be written as a linear combination of other vectors in the list.
Any list that is not linearly dependent is linearly independent.
\subsubsection{Span}
\label{sec:org612d39a}
The span of a list is all linear combinations of that list
\subsubsection{Basis}
\label{sec:orgcb06001}
The basis of a vector space is a linearly indepnedent list of the elements in that vector space that spans the vector space (whose span is the vector space).
A list of vetors is a basis if there is exactly one way to write every vector as a linear combination of the basis.
\begin{enumerate}
\item Results
\label{sec:org43e8ba2}
\begin{enumerate}
\item All bases of a vector space are the same length
\label{sec:org0fc3c1c}
\item A linearly indpendent or spanning list of the right length is a basis (buy one get one free)
\label{sec:org52ff94c}
\end{enumerate}
\end{enumerate}
\subsubsection{Dimension}
\label{sec:orgdc6eca9}
The dimension of a subspace is the length of it's basis. If the basis does not exist (infinitely long), then the space is infinite dimensional.
\subsubsection{Elementry Matrix}
\label{sec:org7dce5cd}
A matrix that applies exactly one valid "row operation": multiply a row, add one row to another, swap row orders.
\subsubsection{Nonsingular / invertible matrix}
\label{sec:org3e31d52}
A non-singular matrix is a matrix that has an inverse, and whose determinant is not zero.
