src/mathematics/linear_algebra/KBe20math530refFallFinalPrep.org
** Linear Transformations
*** Linearity
    A transformation is linear if it satisfies additivity (adding inside/outside same) and homogeneity (scalar multiplying inside/outside same).
*** Injective
    When the outputs being the same implies the inputs were the same. (Mapping is one to one; each element is mapped to atmost once).
*** Surjective
    When every element in the codomain is in the range (Mapping is onto the codomain; each element mapped to atleast once).
*** Linear Map
    A map from one vector space to another that is linear (satisfies additivity and homogeniety)
**** Properties
***** Linear maps from one space to another is a subspace
***** Algebraic Properties
****** Associative: $T_1 \left(T_2 T_3 \right) = \left(T_1 T_2 \right) T_3$
****** Identity: $IT = TI = T$
****** Distributive: $\left(S_1+S_2\right)T = TS_1 + TS_2$
       And the same for the other side, but you have to be careful about whether maps can be multiplied (composed).
**** Product of Linear Map
     The product $ST$ of two linear maps $T \in \mathcal L(U, V)$ and $S \in \mathcal L(V, W)$ is the linear map $S(T(u))$ for $u \in U$.
*** Image (range, column spac)
    Every vector that can be a result of a linear map.
**** Properties
***** CHANGES AFTER RREF!
***** Surjectivity is the same as the column space being the domain (input space?)
*** Kernel (null space)
    Every vector that the linear map sends to zero.
**** Properties
***** Always includes zero
***** Doesn't change after RREF
***** Injectivity is the same as the null space being zero
*** Homogenous System
    A homogenous system is a system of equations where all the right sides are zero.
    A homogenous system always has (the trivial) solution (of zeros).
*** Isomorphism
    An isomorphism is a bijective map from one vector space to another. Two vector spaces are isomorphic if there exists such a map
    There exists such a map iff the two vector spaces are the same dimension.
*** Operator
    A linear map from one vector space to itself
**** Properties
     An operator on a finite dimensional vector space is injective iff it is surjective.
* Important Things
** Linear Dependence Lemma
   *If a list is linearly dependent, then exists one element in the list can be written as a linear combination of the other elements, and the span of the remaining elements is the same as the span of the whole list (that element didn't add anything).*
** Length of a linearly independent list $\le$ length of a spanning list
** (Spanning list contains; linearly independent list extends to) a basis
** Fundamental Theorem of Linear Maps
   If $T$ is a map from a *finite dimensional* vector space $V$, then $\text{range }T$ is finite dimensional and $\text{dim range }T + \text{dim null }T = \text{dim )V$
** I/O Dimension vs injectivity, surjectivity
*** A map to a larger vector space is not surjective
*** A map to a smaller vector space is not injective
** Direct Sum and Linear Independence
   A sum is direct if the bases of the summands are linearly independent.
* Questions!!
** From the template
*** What is an "identity transformation"?
    just the identity map. an operator (must go from a vector space to itself) that does nothing.
    $$T \in \mathcal L(V) : Tv = v$$
