docs/mathematics/linear_algebra/KBe20math530refFallFinalPrep.html
<div id="outline-container-org921229b" class="outline-3">
<h3 id="org921229b"><span class="section-number-3">1.2</span> Linear Transformations</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org053a210" class="outline-4">
<h4 id="org053a210"><span class="section-number-4">1.2.1</span> Linearity</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
A transformation is linear if it satisfies additivity (adding inside/outside same) and homogeneity (scalar multiplying inside/outside same).
</p>
</div>
</div>
<div id="outline-container-org25e8bba" class="outline-4">
<h4 id="org25e8bba"><span class="section-number-4">1.2.2</span> Injective</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
When the outputs being the same implies the inputs were the same. (Mapping is one to one; each element is mapped to atmost once).
</p>
</div>
</div>
<div id="outline-container-orgf79e69f" class="outline-4">
<h4 id="orgf79e69f"><span class="section-number-4">1.2.3</span> Surjective</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
When every element in the codomain is in the range (Mapping is onto the codomain; each element mapped to atleast once).
</p>
</div>
</div>
<div id="outline-container-org71e17d3" class="outline-4">
<h4 id="org71e17d3"><span class="section-number-4">1.2.4</span> Linear Map</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
A map from one vector space to another that is linear (satisfies additivity and homogeniety)
</p>
</div>
<ol class="org-ol">
<li><a id="orgae85e94"></a>Properties<br />
<ol class="org-ol">
<li><a id="orge71db20"></a>Linear maps from one space to another is a subspace<br /></li>
<li><a id="org6759d0f"></a>Algebraic Properties<br />
<ol class="org-ol">
<li><a id="orga932619"></a>Associative: \(T_1 \left(T_2 T_3 \right) = \left(T_1 T_2 \right) T_3\)<br /></li>
<li><a id="org7353c23"></a>Identity: \(IT = TI = T\)<br /></li>
<li><a id="org891b1fb"></a>Distributive: \(\left(S_1+S_2\right)T = TS_1 + TS_2\)<br />
<div class="outline-text-7" id="text-1-2-4-1-2-3">
<p>
And the same for the other side, but you have to be careful about whether maps can be multiplied (composed).
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org7e13946"></a>Product of Linear Map<br />
<div class="outline-text-5" id="text-1-2-4-2">
<p>
The product \(ST\) of two linear maps \(T \in \mathcal L(U, V)\) and \(S \in \mathcal L(V, W)\) is the linear map \(S(T(u))\) for \(u \in U\).
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb9b1ec6" class="outline-4">
<h4 id="orgb9b1ec6"><span class="section-number-4">1.2.5</span> Image (range, column spac)</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Every vector that can be a result of a linear map.
</p>
</div>
<ol class="org-ol">
<li><a id="orgb41b613"></a>Properties<br />
<ol class="org-ol">
<li><a id="org66f1c67"></a>CHANGES AFTER RREF!<br /></li>
<li><a id="orge41d076"></a>Surjectivity is the same as the column space being the domain (input space?)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org622cf10" class="outline-4">
<h4 id="org622cf10"><span class="section-number-4">1.2.6</span> Kernel (null space)</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Every vector that the linear map sends to zero.
</p>
</div>
<ol class="org-ol">
<li><a id="org5897f9f"></a>Properties<br />
<ol class="org-ol">
<li><a id="org7441537"></a>Always includes zero<br /></li>
<li><a id="orgf9dd87d"></a>Doesn't change after RREF<br /></li>
<li><a id="orge55a33c"></a>Injectivity is the same as the null space being zero<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orge64cdb1" class="outline-4">
<h4 id="orge64cdb1"><span class="section-number-4">1.2.7</span> Homogenous System</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
A homogenous system is a system of equations where all the right sides are zero.
A homogenous system always has (the trivial) solution (of zeros).
</p>
</div>
</div>
<div id="outline-container-org49ffa5e" class="outline-4">
<h4 id="org49ffa5e"><span class="section-number-4">1.2.8</span> Isomorphism</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
An isomorphism is a bijective map from one vector space to another. Two vector spaces are isomorphic if there exists such a map
There exists such a map iff the two vector spaces are the same dimension.
</p>
</div>
</div>
<div id="outline-container-orgf7aa4ba" class="outline-4">
<h4 id="orgf7aa4ba"><span class="section-number-4">1.2.9</span> Operator</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
A linear map from one vector space to itself
</p>
</div>
<ol class="org-ol">
<li><a id="orgbe08ffb"></a>Properties<br />
<div class="outline-text-5" id="text-1-2-9-1">
<p>
An operator on a finite dimensional vector space is injective iff it is surjective.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8b08f40" class="outline-2">
<h2 id="org8b08f40"><span class="section-number-2">2</span> Important Things</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf3b2cbe" class="outline-3">
<h3 id="orgf3b2cbe"><span class="section-number-3">2.1</span> Linear Dependence Lemma</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>If a list is linearly dependent, then exists one element in the list can be written as a linear combination of the other elements, and the span of the remaining elements is the same as the span of the whole list (that element didn't add anything).</b>
</p>
</div>
</div>
<div id="outline-container-orgf796f6c" class="outline-3">
<h3 id="orgf796f6c"><span class="section-number-3">2.2</span> Length of a linearly independent list \(\le\) length of a spanning list</h3>
</div>
<div id="outline-container-orge0daf1d" class="outline-3">
<h3 id="orge0daf1d"><span class="section-number-3">2.3</span> (Spanning list contains; linearly independent list extends to) a basis</h3>
</div>
<div id="outline-container-org795db1b" class="outline-3">
<h3 id="org795db1b"><span class="section-number-3">2.4</span> Fundamental Theorem of Linear Maps</h3>
<div class="outline-text-3" id="text-2-4">
<p>
If \(T\) is a map from a <b>finite dimensional</b> vector space \(V\), then \(\text{range }T\) is finite dimensional and \(\text{dim range }T + \text{dim null }T = \text{dim )V\)
</p>
</div>
</div>
<div id="outline-container-org879da29" class="outline-3">
<h3 id="org879da29"><span class="section-number-3">2.5</span> I/O Dimension vs injectivity, surjectivity</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgc4d3658" class="outline-4">
<h4 id="orgc4d3658"><span class="section-number-4">2.5.1</span> A map to a larger vector space is not surjective</h4>
</div>
<div id="outline-container-org9ca15f8" class="outline-4">
<h4 id="org9ca15f8"><span class="section-number-4">2.5.2</span> A map to a smaller vector space is not injective</h4>
</div>
</div>
<div id="outline-container-org20ccc3f" class="outline-3">
<h3 id="org20ccc3f"><span class="section-number-3">2.6</span> Direct Sum and Linear Independence</h3>
<div class="outline-text-3" id="text-2-6">
<p>
A sum is direct if the bases of the summands are linearly independent.
</p>
</div>
</div>
</div>
<div id="outline-container-orgeacaaa4" class="outline-2">
<h2 id="orgeacaaa4"><span class="section-number-2">3</span> Questions!!</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org529969a" class="outline-3">
<h3 id="org529969a"><span class="section-number-3">3.1</span> From the template</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgb78f112" class="outline-4">
<h4 id="orgb78f112"><span class="section-number-4">3.1.1</span> What is an "identity transformation"?</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
just the identity map. an operator (must go from a vector space to itself) that does nothing.
\[T \in \mathcal L(V) : Tv = v\]
</p>
</div>
</div>
