docs/mathematics/linear_algebra/KBe20math530refFallFinalPrep.tex
\subsection{Linear Transformations}
\label{sec:orgbf120ba}
\subsubsection{Linearity}
\label{sec:org2f48820}
A transformation is linear if it satisfies additivity (adding inside/outside same) and homogeneity (scalar multiplying inside/outside same).
\subsubsection{Injective}
\label{sec:org278d5be}
When the outputs being the same implies the inputs were the same. (Mapping is one to one; each element is mapped to atmost once).
\subsubsection{Surjective}
\label{sec:org0a444f2}
When every element in the codomain is in the range (Mapping is onto the codomain; each element mapped to atleast once).
\subsubsection{Linear Map}
\label{sec:org735239c}
A map from one vector space to another that is linear (satisfies additivity and homogeniety)
\begin{enumerate}
\item Properties
\label{sec:org062b364}
\begin{enumerate}
\item Linear maps from one space to another is a subspace
\label{sec:org4e47fc2}
\item Algebraic Properties
\label{sec:org3244b4c}
\begin{enumerate}
\item Associative: \(T_1 \left(T_2 T_3 \right) = \left(T_1 T_2 \right) T_3\)
\label{sec:org8600cd7}
\item Identity: \(IT = TI = T\)
\label{sec:org3a645f8}
\item Distributive: \(\left(S_1+S_2\right)T = TS_1 + TS_2\)
\label{sec:org2f5dddd}
And the same for the other side, but you have to be careful about whether maps can be multiplied (composed).
\end{enumerate}
\end{enumerate}
\item Product of Linear Map
\label{sec:orgc58cf0e}
The product \(ST\) of two linear maps \(T \in \mathcal L(U, V)\) and \(S \in \mathcal L(V, W)\) is the linear map \(S(T(u))\) for \(u \in U\).
\end{enumerate}
\subsubsection{Image (range, column spac)}
\label{sec:org1df15d2}
Every vector that can be a result of a linear map.
\begin{enumerate}
\item Properties
\label{sec:org9b46d08}
\begin{enumerate}
\item CHANGES AFTER RREF!
\label{sec:orgdbe8687}
\item Surjectivity is the same as the column space being the domain (input space?)
\label{sec:org68f0ccc}
\end{enumerate}
\end{enumerate}
\subsubsection{Kernel (null space)}
\label{sec:org06e239c}
Every vector that the linear map sends to zero.
\begin{enumerate}
\item Properties
\label{sec:org1877c56}
\begin{enumerate}
\item Always includes zero
\label{sec:org874f1c0}
\item Doesn't change after RREF
\label{sec:org0c6d2ba}
\item Injectivity is the same as the null space being zero
\label{sec:org2d6a94b}
\end{enumerate}
\end{enumerate}
\subsubsection{Homogenous System}
\label{sec:org78ad2ce}
A homogenous system is a system of equations where all the right sides are zero.
A homogenous system always has (the trivial) solution (of zeros).
\subsubsection{Isomorphism}
\label{sec:org2aabf6c}
An isomorphism is a bijective map from one vector space to another. Two vector spaces are isomorphic if there exists such a map
There exists such a map iff the two vector spaces are the same dimension.
\subsubsection{Operator}
\label{sec:orgedd056f}
A linear map from one vector space to itself
\begin{enumerate}
\item Properties
\label{sec:org10c1245}
An operator on a finite dimensional vector space is injective iff it is surjective.
\end{enumerate}
\section{Important Things}
\label{sec:org14f8a4e}
\subsection{Linear Dependence Lemma}
\label{sec:org68b19ea}
\textbf{If a list is linearly dependent, then exists one element in the list can be written as a linear combination of the other elements, and the span of the remaining elements is the same as the span of the whole list (that element didn't add anything).}
\subsection{Length of a linearly independent list \(\le\) length of a spanning list}
\label{sec:org5d1790a}
\subsection{(Spanning list contains; linearly independent list extends to) a basis}
\label{sec:orgdf3a972}
\subsection{Fundamental Theorem of Linear Maps}
\label{sec:orgcece4e1}
If \(T\) is a map from a \textbf{finite dimensional} vector space \(V\), then \(\text{range }T\) is finite dimensional and \(\text{dim range }T + \text{dim null }T = \text{dim )V\)
\subsection{I/O Dimension vs injectivity, surjectivity}
\label{sec:org99ff053}
\subsubsection{A map to a larger vector space is not surjective}
\label{sec:org52719ab}
\subsubsection{A map to a smaller vector space is not injective}
\label{sec:org03c1cf2}
\subsection{Direct Sum and Linear Independence}
\label{sec:org375b62e}
A sum is direct if the bases of the summands are linearly independent.
\section{Questions!!}
\label{sec:org92075a4}
\subsection{From the template}
\label{sec:org8690122}
\subsubsection{What is an "identity transformation"?}
\label{sec:org7d91c11}
just the identity map. an operator (must go from a vector space to itself) that does nothing.
$$T \in \mathcal L(V) : Tv = v$$
