src/mathematics/linear_algebra/KBe20math530refFallFinalPrep.org
*** What is the geometric interpretation of the determinant?
    turn rows into vectors, take the size of the parrallelogram. (magnitude of top multiplied by magnitude of bottom?)
*** What is the definition of "linearity"? How do you Apply it?
    Whether a map is linear (satisfies additivity and homogeneity).
*** What is the rank nullity theorem?
    It is the Fundamental Theorem of Linear Algebra
*** isomorphism vs bijective maps?
    There are bijective maps that are not isomorphisms, but because in linear algebra every map maintains structure, it is automatically an isomorphism if it is bijective.
*** What is the connection between range/null space and nonsingularity?
    In order for a map/matrix to be invertible, its rows and columns must be linearly independent?
