docs/mathematics/linear_algebra/KBe20math530refFallFinalPrep.tex
\subsubsection{What is the geometric interpretation of the determinant?}
\label{sec:org123b17a}
turn rows into vectors, take the size of the parrallelogram. (magnitude of top multiplied by magnitude of bottom?)
\subsubsection{What is the definition of "linearity"? How do you Apply it?}
\label{sec:orgc0ff80c}
Whether a map is linear (satisfies additivity and homogeneity).
\subsubsection{What is the rank nullity theorem?}
\label{sec:org8486787}
It is the Fundamental Theorem of Linear Algebra
\subsubsection{isomorphism vs bijective maps?}
\label{sec:orgf0c0c73}
There are bijective maps that are not isomorphisms, but because in linear algebra every map maintains structure, it is automatically an isomorphism if it is bijective.
\subsubsection{What is the connection between range/null space and nonsingularity?}
\label{sec:org5c9a1dc}
In order for a map/matrix to be invertible, its rows and columns must be linearly independent?
\end{document}
